payloads/kiosks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:VDIDataExchangeService">
    <soapenv:Header/>
    <soapenv:Body>
        <VDIDataExchange xmlns="urn:VDIDataExchangeService" xmlns:ns2="http://schemas.microsoft.com/2003/10/Serialization/">
            <VDIXMLVersion>1</VDIXMLVersion>
            <VDIXMLType>mms-kiosks</VDIXMLType>
            <ProviderID>swyft</ProviderID>
            <ApplicationID>swyft-vdi-integration</ApplicationID>
            <ApplicationVersion>1.0</ApplicationVersion>
            <TransactionID>e3c9a5b2-7f92-4c51-9ac9-223b7df963af</TransactionID>
            <TransactionTime>2025-11-18T07:04:06.4288410Z</TransactionTime>
            <OperatorID>nm_swyft</OperatorID>

            <CompressionType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <CompressionParam xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <Encoding>utf-8</Encoding>

            <VDIXML xmlns:ns3="urn:VDIDataExchangeService">&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;VDITransaction xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; VDIXMLVersion=&quot;1&quot; VDIXMLType=&quot;mms-kiosks&quot; ProviderID=&quot;swyft&quot; ApplicationID=&quot;swyft-app-id&quot; ApplicationVersion=&quot;1.0&quot; TransactionID=&quot;e3c9a5b2-7f92-4c51-9ac9-223b7df963af&quot; TransactionTime=&quot;2025-11-18T07:04:06.4288410Z&quot; OperatorID=&quot;nm_swyft&quot;&gt;
    &lt;KiosksCollection&gt;
        &lt;Kiosk MarketID=&quot;2&quot; KioskID=&quot;PY-KIOSK&quot; KioskSN=&quot;PY0001&quot; LastSync=&quot;2025-11-18T07:04:06.4288410Z&quot; LastTransaction=&quot;2025-11-18T07:04:06.4288410Z&quot; CatalogVersion=&quot;2025-11-18T07:04:06.4288410Z&quot; /&gt;
    &lt;/KiosksCollection&gt;
&lt;/VDITransaction&gt;</VDIXML>

            <UserData xmlns:ns3="urn:VDIDataExchangeService" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
        </VDIDataExchange>
    </soapenv:Body>
</soapenv:Envelope>
